CSI API ETABS v1
eObjType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eObjType
Public Enumeration eObjType
Dim instance As eObjType
public enum class eObjType
type eObjType
Members
Member name | Value | Description
Point | 1
Frame | 2
Area | 3
Solid | 6
See Also
Reference
ETABSv1 Namespace